tutorials/hopperFlow/0/href_nlgf.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      href_nlgf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0.800419;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           $internalField;
    }
    top
    {
        type            fixedValue;
        value           $internalField;
    }
    orifice
    {
        type            fixedValue;
	value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}
