tutorials/hopperFlow/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../parameters";
dimensions          [1 -1 -2 0 0 0 0];

internalField   uniform $pRef;

boundaryField
{
    walls
    {
     	type               calculated;
        value              $internalField;
    }
    top
    {
     	type               calculated;
	value              $internalField;
    }
    orifice
    {
     	type               calculated;
        value              $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
