tutorials/hopperFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
 (0.222 0 0)
 (0 0.489396 0)
 (0.494 0.489396 0)
 (0.272 0 0)
 (0.222 0 0.06)
 (0 0.489396 0.06)
 (0.494 0.489396 0.06)
 (0.272 0 0.06)
 (0 1.0894 0)
 (0.494 1.0894 0)
 (0 1.0894 0.06)
 (0.494 1.0894 0.06)
);

blocks
(
 hex (0 3 2 1 4 7 6 5) (30 33 1) simpleGrading (1 1 1)
 hex (1 2 9 8 5 6 11 10) (30 26 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
 wall walls
 (
  (8 1 5 10)
  (9 2 6 11)
  (1 0 4 5)
  (2 3 7 6)
 )
 atmosphere top
 (
  (8 9 11 10)
 )
 atmosphere orifice
 (
  (0 3 7 4)
 )
);

mergePatchPairs
(
);

// ************************************************************************* //
