tutorials/hopperFlow/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
 volScalarFieldValue alpha.air 1
 volScalarFieldValue alpha.particles 0
);

regions
(
 boxToCell
 {
   box (0 0 0) (0.494 0.789396 0.06);
   fieldValues
     (
      volScalarFieldValue alpha.air 0.45
      volScalarFieldValue alpha.particles 0.55
     );
 }
);


// ************************************************************************* //
